//
//  MockData.swift
//  JiShi-Building
//
//  Created by mount_potato on 2022/4/2.
//


let westCorridor = ["Sports Zone","407","408","409","414","417"]
let northCorridor = ["426","430","Chess Zone","434"]
let eastCorridor = ["442","448","452","Dean Room"]

// TODO
let totalRoom = westCorridor + northCorridor + eastCorridor

let keyDict:[String:[String]] = ["407":["实验室","张荣庆"],
                                 "408":["办公室","张林","款爷"],
                                 "409":["实验室","杜庆峰"],
                                 "414":["办公室","毛哥"],
                                 "417":["会议室","党会"],
                                 "426":["机房","最优化"],
                                 "430":["机房","JavaEE"],
                                 "434":["教室","数据库"],
                                 "Chess Zone":["休闲","下棋"],
                                 "Sports Zone":["休息","体育"],
                                 "442":["办公室","张荣庆"],
                                 "448":["办公室","王彩霞"],
                                 "452":["办公室","院长"],
                                 "Dean Room":["会议室","院长"]]


let descriptionDict:[String: String] = ["Sports Zone":"软院大学生身体机能复健中心，打台球，打乒乓都可",
                                        "407":"靠近男洗手间的实验室，是张荣庆老师的实验室",
                                        "408":"靠近女洗手间的办公室，是款爷，张林，赵姐，张颖老师等人的办公室",
                                        "409":"杜庆峰老师的实验室，搞DevOps的",
                                        "414":"毛哥的一个办公场所",
                                        "417":"主会议室，但学生用的比老师多hhh",
                                        "426":"机房，小的要命，但电脑是新的",
                                        "430":"软件数据方向常用课室与机房",
                                        "Chess Zone":"下棋，弹琴的地方，钢琴有点烂但凑合能听",
                                        "434":"软院唯一教室",
                                        "442":"张荣庆老师的办公室",
                                        "448":"王彩霞老师的办公室，王老师人真好",
                                        "452":"院长办公室，大门常开",
                                        "Dean Room":"软件学院主会议室，很高级"]

